export const pointTypes = [
  `Taxi`,
  `Bus`,
  `Train`,
  `Ship`,
  `Transport`,
  `Drive`,
  `Flight`,
  `Check-in`,
  `Sightseeing`,
  `Restaurant`
];

export const towns = [
  `Yerevan`,
  `Moscow`,
  `Liverpool`,
  `Rostov`,
  `Riga`,
  `Pskov`,
  `Saint Petersburg`,
  `London`,
  `Rome`,
  `Genoa`,
  `Berlin`,
  `Marseille`,
  `Paris`,
  `Kyiv`,
  `Minsk`,
  `Kaliningrad`
];

export const descriptions = [
  `Узкие булыжные улочки этого города переплетаются, создавая уникальный узор истории, культуры и современной жизни.`,
  `Высокие небоскрёбы отражают радужные отблески утреннего света, придавая городу величественный и современный вид.`,
  `Через город протекают живописные реки, создавая идиллические зоны отдыха и связывая различные районы в единое целое.`,
  `Пышные зеленые парки придают городу ощущение тропического райского уголка, наполненного свежим воздухом и пением птиц.`,
  `Главная площадь, оживленная и яркая, становится местом встречи для местных жителей и туристов, желающих насладиться культурой и гастрономией.`,
  `Исторические здания с вековыми росписями рядом с ультрасовременной архитектурой создают уникальный контраст старины и новизны.`,
  `Уютные кафе на каждом углу улиц предлагают вкуснейшие местные блюда, привлекая гурманов со всего мира.`,
  `Набережные этого города идеально подходят для вечерних прогулок, где можно насладиться видами на оживленную реку и городские огни.`,
  `Вечерний город оживает благодаря ярким неоновым вывескам и уличным музыкантам, создавая неповторимую атмосферу радости и свободы.`,
  `В этом городе современные арт-галереи и музеи соседствуют с античными руинами, напоминая о богатой исторической наследии.`,
];


export const offers = new Map([
  [
    pointTypes[0],
    [
      {
        name: `Некурящий водитель`,
        cost: 2,
      },
      {
        name: `Помощь с багажом`,
        cost: 10,
      },
      {
        name: `Бронь на время`,
        cost: 20,
      },
    ]
  ],
  [
    pointTypes[1],
    [
      {
        name: `Выслать расписание`,
        cost: 2,
      },
    ]
  ],
  [
    pointTypes[2],
    [
      {
        name: `Выслать расписание`,
        cost: 2,
      },
      {
        name: `Доп. место для питомца`,
        cost: 10,
      },
    ]
  ],
  [
    pointTypes[3],
    [
      {
        name: `Просторная каюта`,
        cost: 45,
      },
      {
        name: `Ужин включен`,
        cost: 15,
      },
      {
        name: `Страховка`,
        cost: 25,
      },
    ]
  ],
  [
    pointTypes[4],
    [
      {
        name: `Помощь с выбором`,
        cost: 10,
      },
    ]
  ],
  [
    pointTypes[5],
    [
      {
        name: `Водитель на день`,
        cost: 200,
      },
      {
        name: `Помощь с багажом`,
        cost: 10,
      },
      {
        name: `Бронь на время`,
        cost: 20,
      },
    ]
  ],
  [
    pointTypes[6],
    [
      {
        name: `Багаж`,
        cost: 20,
      },
      {
        name: `Ненормативный багаж`,
        cost: 40,
      },
      {
        name: `Регистрация заранее`,
        cost: 20,
      },
    ]
  ],
  [
    pointTypes[7],
    [
      {
        name: `Некурящий водитель`,
        cost: 2,
      },
      {
        name: `Помощь с багажом`,
        cost: 10,
      },
      {
        name: `Бронь на время`,
        cost: 20,
      },
    ]
  ],
  [
    pointTypes[8],
    [
      {
        name: `Некурящий водитель`,
        cost: 2,
      },
      {
        name: `Помощь с багажом`,
        cost: 10,
      },
      {
        name: `Бронь на время`,
        cost: 20,
      },
    ]
  ],
  [
    pointTypes[9],
    [
      {
        name: `Столик у окна`,
        cost: 15,
      },
      {
        name: `Бронь на время`,
        cost: 20,
      },
    ]
  ],
]);
