export const pointTypes = [
  `Taxi`,
  `Bus`,
  `Train`,
  `Ship`,
  `Transport`,
  `Drive`,
  `Flight`,
  `Check-in`,
  `Sightseeing`,
  `Restaurant`
];

export const towns = [
  `Yerevan`,
  `Moscow`,
  `Liverpool`,
  `Rostov`,
  `Riga`,
  `Pskov`,
  `Saint Petersburg`,
  `London`,
  `Rome`,
  `Genoa`,
  `Berlin`,
  `Marseille`,
  `Paris`,
  `Kyiv`,
  `Minsk`,
  `Kaliningrad`
];

export const descriptions = [
  `Узкие булыжные улочки этого города переплетаются, создавая уникальный узор истории, культуры и современной жизни.`,
  `Высокие небоскрёбы отражают радужные отблески утреннего света, придавая городу величественный и современный вид.`,
  `Через город протекают живописные реки, создавая идиллические зоны отдыха и связывая различные районы в единое целое.`,
  `Пышные зеленые парки придают городу ощущение тропического райского уголка, наполненного свежим воздухом и пением птиц.`,
  `Главная площадь, оживленная и яркая, становится местом встречи для местных жителей и туристов, желающих насладиться культурой и гастрономией.`,
  `Исторические здания с вековыми росписями рядом с ультрасовременной архитектурой создают уникальный контраст старины и новизны.`,
  `Уютные кафе на каждом углу улиц предлагают вкуснейшие местные блюда, привлекая гурманов со всего мира.`,
  `Набережные этого города идеально подходят для вечерних прогулок, где можно насладиться видами на оживленную реку и городские огни.`,
  `Вечерний город оживает благодаря ярким неоновым вывескам и уличным музыкантам, создавая неповторимую атмосферу радости и свободы.`,
  `В этом городе современные арт-галереи и музеи соседствуют с античными руинами, напоминая о богатой исторической наследии.`,
];
